SebastianOberschwendtner/OTOS/mocking/stm32/timer_stm32_fake.h
/**
 * OTOS - Open Tec Operating System
 * Copyright (c) 2021 Sebastian Oberschwendtner, sebastian.oberschwendtner@gmail.com
 *
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 *
 * @attention
 * All the peripheral type definition are taken from the peripheral library
 * files provided by ST.
 * 
 * Copyright:
 * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
 */

#ifndef TIMER_STM32_FAKE_H_
#define TIMER_STM32_FAKE_H_

// *** Includes ***
#include "../base/fake.h"
#include <cstdint>

// *** Class defines for fake peripherals
/** 
  * @brief TIM
  */

class TIM_TypeDef: public Fake::Peripheral
{
public:
  // Methods for unit testing
  void registers_to_default(void) override;

  // Fake registers of port
  Fake::Register_t CR1;         /*!< TIM control register 1,              Address offset: 0x00 */
  Fake::Register_t CR2;         /*!< TIM control register 2,              Address offset: 0x04 */
  Fake::Register_t SMCR;        /*!< TIM slave mode control register,     Address offset: 0x08 */
  Fake::Register_t DIER;        /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  Fake::Register_t SR;          /*!< TIM status register,                 Address offset: 0x10 */
  Fake::Register_t EGR;         /*!< TIM event generation register,       Address offset: 0x14 */
  Fake::Register_t CCMR1;       /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  Fake::Register_t CCMR2;       /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  Fake::Register_t CCER;        /*!< TIM capture/compare enable register, Address offset: 0x20 */
  Fake::Register_t CNT;         /*!< TIM counter register,                Address offset: 0x24 */
  Fake::Register_t PSC;         /*!< TIM prescaler,                       Address offset: 0x28 */
  Fake::Register_t ARR;         /*!< TIM auto-reload register,            Address offset: 0x2C */
  Fake::Register_t RCR;         /*!< TIM repetition counter register,     Address offset: 0x30 */
  Fake::Register_t CCR1;        /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  Fake::Register_t CCR2;        /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  Fake::Register_t CCR3;        /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  Fake::Register_t CCR4;        /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  Fake::Register_t BDTR;        /*!< TIM break and dead-time register,    Address offset: 0x44 */
  Fake::Register_t DCR;         /*!< TIM DMA control register,            Address offset: 0x48 */
  Fake::Register_t DMAR;        /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  Fake::Register_t OR;          /*!< TIM option register,                 Address offset: 0x50 */
};

// *** Public references to fake peripherals
// Fake peripheral pointers
extern TIM_TypeDef* TIM1;
extern TIM_TypeDef* TIM2;

// Fake addresses
extern std::uintptr_t TIM1_BASE;
extern std::uintptr_t TIM2_BASE;

// === Bitmasks ===

/******************************************************************************/
/*                                                                            */
/*                                    TIM                                     */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for TIM_CR1 register  ********************/
#define TIM_CR1_CEN_Pos           (0U)                                         
#define TIM_CR1_CEN_Msk           (0x1UL << TIM_CR1_CEN_Pos)                    /*!< 0x00000001 */
#define TIM_CR1_CEN               TIM_CR1_CEN_Msk                              /*!<Counter enable        */
#define TIM_CR1_UDIS_Pos          (1U)                                         
#define TIM_CR1_UDIS_Msk          (0x1UL << TIM_CR1_UDIS_Pos)                   /*!< 0x00000002 */
#define TIM_CR1_UDIS              TIM_CR1_UDIS_Msk                             /*!<Update disable        */
#define TIM_CR1_URS_Pos           (2U)                                         
#define TIM_CR1_URS_Msk           (0x1UL << TIM_CR1_URS_Pos)                    /*!< 0x00000004 */
#define TIM_CR1_URS               TIM_CR1_URS_Msk                              /*!<Update request source */
#define TIM_CR1_OPM_Pos           (3U)                                         
#define TIM_CR1_OPM_Msk           (0x1UL << TIM_CR1_OPM_Pos)                    /*!< 0x00000008 */
#define TIM_CR1_OPM               TIM_CR1_OPM_Msk                              /*!<One pulse mode        */
#define TIM_CR1_DIR_Pos           (4U)                                         
#define TIM_CR1_DIR_Msk           (0x1UL << TIM_CR1_DIR_Pos)                    /*!< 0x00000010 */
#define TIM_CR1_DIR               TIM_CR1_DIR_Msk                              /*!<Direction             */

#define TIM_CR1_CMS_Pos           (5U)                                         
#define TIM_CR1_CMS_Msk           (0x3UL << TIM_CR1_CMS_Pos)                    /*!< 0x00000060 */
#define TIM_CR1_CMS               TIM_CR1_CMS_Msk                              /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CR1_CMS_0             (0x1UL << TIM_CR1_CMS_Pos)                    /*!< 0x0020 */
#define TIM_CR1_CMS_1             (0x2UL << TIM_CR1_CMS_Pos)                    /*!< 0x0040 */

#define TIM_CR1_ARPE_Pos          (7U)                                         
#define TIM_CR1_ARPE_Msk          (0x1UL << TIM_CR1_ARPE_Pos)                   /*!< 0x00000080 */
#define TIM_CR1_ARPE              TIM_CR1_ARPE_Msk                             /*!<Auto-reload preload enable     */

#define TIM_CR1_CKD_Pos           (8U)                                         
#define TIM_CR1_CKD_Msk           (0x3UL << TIM_CR1_CKD_Pos)                    /*!< 0x00000300 */
#define TIM_CR1_CKD               TIM_CR1_CKD_Msk                              /*!<CKD[1:0] bits (clock division) */
#define TIM_CR1_CKD_0             (0x1UL << TIM_CR1_CKD_Pos)                    /*!< 0x0100 */
#define TIM_CR1_CKD_1             (0x2UL << TIM_CR1_CKD_Pos)                    /*!< 0x0200 */

